In [4]:
import pandas

In [5]:
data = pandas.read_csv('titanic.csv', index_col='PassengerId')
data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
data['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [8]:
# to find proportion of every constituent 
data['Survived'].value_counts(normalize=True)

0    0.616162
1    0.383838
Name: Survived, dtype: float64

In [9]:
data['Pclass'].value_counts(normalize=True)

3    0.551066
1    0.242424
2    0.206510
Name: Pclass, dtype: float64

In [10]:
[data['Age'].mean(), data['Age'].median()]

[29.69911764705882, 28.0]

In [14]:
for i in range(1, 892):
    try:
        data['Name'][i] = (data['Name'][i].split(' '))[2]
    except:
        pass
data['Name'].value_counts()[:20]

William      48
John         31
Thomas       19
Charles      16
George       16
James        15
Henry        15
Edward       13
Frederick    13
Mr.          12
Richard      11
Johan        10
Samuel        9
Mary          9
Anna          9
Joseph        9
Karl          9
Alfred        7
Albert        7
Arthur        7
Name: Name, dtype: int64